import React from "react";
import { Carousel, Row, Col } from "antd";
import SellerCard from "./SellerCard";

function onChange(a, b, c) {
  console.log(a, b, c);
}

const contentStyle = {
  height: "280px",
  color: "#fff",
  lineHeight: "160px",
  textAlign: "center",
  backgroundImage:
    "url('https://www.digikala.com/mag/wp-content/uploads/2020/08/DK-rebranding2.jpg')",
  backgroundPosition: "center",
  backgroundSize: "cover",
};

const contentStyle2 = {
  height: "280px",
  color: "#fff",
  lineHeight: "160px",
  textAlign: "center",
  backgroundImage:
    "url('https://play-lh.googleusercontent.com/MVsYcTEpjurZTZWHZXS_4AvNnBtjozswFujGEWa20PkK9xAB2JrYU3EmJnu9_VX_LlY')",
  backgroundPosition: "center",
  backgroundSize: "cover",
};

export default function sellers() {
  return (
    <div className="sellers-container">
      <Row className="mt-2">
        {data.map((item, index) => {
          return (
            <Col span={8}>
              <SellerCard data={item} key={index} />
            </Col>
          );
        })}
      </Row>
    </div>
  );
}

const data = [
  {
    img: "https://www.digikala.com/mag/wp-content/uploads/2020/08/DK-rebranding2.jpg",
    name: "دیجی کالا",
    description:
      "دیجی‌کالا به عنوان یکی از قدیمی‌ترین فروشگاه های اینترنتی با بیشاز یک دهه تجربه، با پایبندی به سه اصل، پرداخت در محل، ۷ روزضمانت بازگشت کالا و تضمین اصل‌بودن کالا موفق شده تا همگام بافروشگاه‌های معتبر جهان، به بزرگ‌ترین فروشگاه اینترنتی ایرانتبدیل شود. به محض ورود به سایت دیجی‌کالا با دنیایی از کالا رو برو می‌شوید! هر آنچه که نیاز دارید و به ذهن شما خطور می‌کند در",
    commision: 8,
  },
  {
    img: "https://itresan.com/wp-content/uploads/2020/01/alibaba5.jpg",
    name: "علی بایا",
    description:
      "علی‌بابا بزرگترین و معتبرترین سایت خرید اینترنتی بلیط هواپیما ، قطار و اتوبوس در کشور است که از سال ۱۳۹۳ کار خود را شروع کرده و در این مدت توانسته رضایت درصد قابل توجهی از کاربران را به دست بیاورد. در ابتدا، فروش بلیط پرواز داخلی در دستور کار علی‌بابا قرار داشت؛ اما به مرور امکان خرید سایر محصولات گردشگری نیز به علی‌بابا اضافه شد.",
    commision: 15,
  },
  {
    img: "https://roozbon.ir/wp-content/uploads/2018/10/12125118_xl.jpg",
    name: "اکالا",
    description:
      "سوپرمارکت اینترنتی اُکالا، تجربه خرید آنلاین به ‌یادماندنی برای شما است. شما می‌توانید تمام محصولات و نیازهای روزانه خود را از انواع خواروبار تا همه نوع محصولات سوپرمارکتی، ازجمله انواع مواد غذایی، نوشیدنی و دم‌نوش‌ها، محصولات بهداشتی زیبایی، انواع ابزار و ملزومات را با تخفیف مناسب در فروشگاه اینترنتی اُکالا تهیه کنید",
    commision: 25,
  },
  {
    img: "https://way2pay.ir/wp-content/uploads/lendo-1000-way2pay-99-08-05-1.jpg",
    name: "لندو",
    description:
      "لندو سامانه خرید اقساطی کالا از فروشگاه‌های اینترنتی‌ست. شما می‌توانید با ضمانت سفته و بدون نیاز به ضامن درخواست اعتبار کرده و پس از اعتبارسنجی، تا ۲۰ میلیون تومان از فروشگاه‌ مدنظرتان اقساطی خرید کنید.",
    commision: 5,
  },
  {
    img: "https://itresan.com/wp-content/uploads/2020/01/alibaba5.jpg",
    name: "علی بایا",
    description:
      "علی‌بابا بزرگترین و معتبرترین سایت خرید اینترنتی بلیط هواپیما ، قطار و اتوبوس در کشور است که از سال ۱۳۹۳ کار خود را شروع کرده و در این مدت توانسته رضایت درصد قابل توجهی از کاربران را به دست بیاورد. در ابتدا، فروش بلیط پرواز داخلی در دستور کار علی‌بابا قرار داشت؛ اما به مرور امکان خرید سایر محصولات گردشگری نیز به علی‌بابا اضافه شد.",
    commision: 15,
  },
  {
    img: "https://way2pay.ir/wp-content/uploads/lendo-1000-way2pay-99-08-05-1.jpg",
    name: "لندو",
    description:
      "لندو سامانه خرید اقساطی کالا از فروشگاه‌های اینترنتی‌ست. شما می‌توانید با ضمانت سفته و بدون نیاز به ضامن درخواست اعتبار کرده و پس از اعتبارسنجی، تا ۲۰ میلیون تومان از فروشگاه‌ مدنظرتان اقساطی خرید کنید.",
    commision: 5,
  },
  {
    img: "https://roozbon.ir/wp-content/uploads/2018/10/12125118_xl.jpg",
    name: "اکالا",
    description:
      "سوپرمارکت اینترنتی اُکالا، تجربه خرید آنلاین به ‌یادماندنی برای شما است. شما می‌توانید تمام محصولات و نیازهای روزانه خود را از انواع خواروبار تا همه نوع محصولات سوپرمارکتی، ازجمله انواع مواد غذایی، نوشیدنی و دم‌نوش‌ها، محصولات بهداشتی زیبایی، انواع ابزار و ملزومات را با تخفیف مناسب در فروشگاه اینترنتی اُکالا تهیه کنید",
    commision: 25,
  },
  {
    img: "https://way2pay.ir/wp-content/uploads/lendo-1000-way2pay-99-08-05-1.jpg",
    name: "لندو",
    description:
      "لندو سامانه خرید اقساطی کالا از فروشگاه‌های اینترنتی‌ست. شما می‌توانید با ضمانت سفته و بدون نیاز به ضامن درخواست اعتبار کرده و پس از اعتبارسنجی، تا ۲۰ میلیون تومان از فروشگاه‌ مدنظرتان اقساطی خرید کنید.",
    commision: 5,
  },

  {
    img: "https://itresan.com/wp-content/uploads/2020/01/alibaba5.jpg",
    name: "علی بایا",
    description:
      "علی‌بابا بزرگترین و معتبرترین سایت خرید اینترنتی بلیط هواپیما ، قطار و اتوبوس در کشور است که از سال ۱۳۹۳ کار خود را شروع کرده و در این مدت توانسته رضایت درصد قابل توجهی از کاربران را به دست بیاورد. در ابتدا، فروش بلیط پرواز داخلی در دستور کار علی‌بابا قرار داشت؛ اما به مرور امکان خرید سایر محصولات گردشگری نیز به علی‌بابا اضافه شد.",
    commision: 15,
  },
  {
    img: "https://www.digikala.com/mag/wp-content/uploads/2020/08/DK-rebranding2.jpg",
    name: "دیجی کالا",
    description:
      "دیجی‌کالا به عنوان یکی از قدیمی‌ترین فروشگاه های اینترنتی با بیشاز یک دهه تجربه، با پایبندی به سه اصل، پرداخت در محل، ۷ روزضمانت بازگشت کالا و تضمین اصل‌بودن کالا موفق شده تا همگام بافروشگاه‌های معتبر جهان، به بزرگ‌ترین فروشگاه اینترنتی ایرانتبدیل شود. به محض ورود به سایت دیجی‌کالا با دنیایی از کالا رو برو می‌شوید! هر آنچه که نیاز دارید و به ذهن شما خطور می‌کند در",
    commision: 8,
  },
];
